## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_manifest.certificate_argo will be created
+   resource "kubernetes_manifest" "certificate_argo" {
+       manifest = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               name      = "argocd-cert"
+               namespace = "istio-system"
            }
+           spec       = {
+               commonName = "argocd.wayofthesys.com"
+               dnsNames   = [
+                   "argocd.wayofthesys.com",
                ]
+               issuerRef  = {
+                   kind = "ClusterIssuer"
+                   name = "zerossl"
                }
+               secretName = "argocd-tls"
            }
        }
+       object   = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd-cert"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               additionalOutputFormats = (known after apply)
+               commonName              = "argocd.wayofthesys.com"
+               dnsNames                = [
+                   "argocd.wayofthesys.com",
                ]
+               duration                = (known after apply)
+               emailAddresses          = (known after apply)
+               encodeUsagesInRequest   = (known after apply)
+               ipAddresses             = (known after apply)
+               isCA                    = (known after apply)
+               issuerRef               = {
+                   group = (known after apply)
+                   kind  = "ClusterIssuer"
+                   name  = "zerossl"
                }
+               keystores               = {
+                   jks    = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
+                   pkcs12 = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
                }
+               literalSubject          = (known after apply)
+               privateKey              = {
+                   algorithm      = (known after apply)
+                   encoding       = (known after apply)
+                   rotationPolicy = (known after apply)
+                   size           = (known after apply)
                }
+               renewBefore             = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               secretName              = "argocd-tls"
+               secretTemplate          = {
+                   annotations = (known after apply)
+                   labels      = (known after apply)
                }
+               subject                 = {
+                   countries           = (known after apply)
+                   localities          = (known after apply)
+                   organizationalUnits = (known after apply)
+                   organizations       = (known after apply)
+                   postalCodes         = (known after apply)
+                   provinces           = (known after apply)
+                   serialNumber        = (known after apply)
+                   streetAddresses     = (known after apply)
                }
+               uris                    = (known after apply)
+               usages                  = (known after apply)
            }
        }
    }

  # kubernetes_manifest.certificate_cinema will be created
+   resource "kubernetes_manifest" "certificate_cinema" {
+       manifest = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               name      = "cinema-cert"
+               namespace = "istio-system"
            }
+           spec       = {
+               commonName = "wayofthesys.com"
+               dnsNames   = [
+                   "wayofthesys.com",
                ]
+               issuerRef  = {
+                   kind = "ClusterIssuer"
+                   name = "zerossl"
                }
+               secretName = "wayofthesys-com-tls"
            }
        }
+       object   = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema-cert"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               additionalOutputFormats = (known after apply)
+               commonName              = "wayofthesys.com"
+               dnsNames                = [
+                   "wayofthesys.com",
                ]
+               duration                = (known after apply)
+               emailAddresses          = (known after apply)
+               encodeUsagesInRequest   = (known after apply)
+               ipAddresses             = (known after apply)
+               isCA                    = (known after apply)
+               issuerRef               = {
+                   group = (known after apply)
+                   kind  = "ClusterIssuer"
+                   name  = "zerossl"
                }
+               keystores               = {
+                   jks    = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
+                   pkcs12 = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
                }
+               literalSubject          = (known after apply)
+               privateKey              = {
+                   algorithm      = (known after apply)
+                   encoding       = (known after apply)
+                   rotationPolicy = (known after apply)
+                   size           = (known after apply)
                }
+               renewBefore             = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               secretName              = "wayofthesys-com-tls"
+               secretTemplate          = {
+                   annotations = (known after apply)
+                   labels      = (known after apply)
                }
+               subject                 = {
+                   countries           = (known after apply)
+                   localities          = (known after apply)
+                   organizationalUnits = (known after apply)
+                   organizations       = (known after apply)
+                   postalCodes         = (known after apply)
+                   provinces           = (known after apply)
+                   serialNumber        = (known after apply)
+                   streetAddresses     = (known after apply)
                }
+               uris                    = (known after apply)
+               usages                  = (known after apply)
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.argocd-tls will be created
+   resource "kubernetes_secret" "argocd-tls" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "tls"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-tls"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
